Revit 2027 API
AirHeatExchangerType Enumeration
 The type of air loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AirHeatExchangerType
Public Enumeration AirHeatExchangerType
public enum class AirHeatExchangerType
type AirHeatExchangerType
Members
Member name | Value | Description
Enthalpy | 1
None | 0
Sensible | 2
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace